# DataFrame Element Operations

In [57]:
import pandas as pd
import numpy as np

In [58]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [59]:
dictionary = {
    "var1": s1,
    "var2": s2,
    "var3": s3,

}

In [60]:
dictionary

{'var1': array([5, 8, 4, 7, 9]),
 'var2': array([9, 3, 6, 2, 1]),
 'var3': array([0, 4, 1, 1, 8])}

In [61]:
df = pd.DataFrame(dictionary)
df

   var1  var2  var3
0     5     9     0
1     8     3     4
2     4     6     1
3     7     2     1
4     9     1     8

In [62]:
df[0:1]

   var1  var2  var3
0     5     9     0

In [63]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [64]:
df

   var1  var2  var3
0     5     9     0
1     8     3     4
2     4     6     1
3     7     2     1
4     9     1     8

In [65]:
df[1: 4]

   var1  var2  var3
1     8     3     4
2     4     6     1
3     7     2     1

In [66]:
df.drop(0)

   var1  var2  var3
1     8     3     4
2     4     6     1
3     7     2     1
4     9     1     8

In [67]:
df

   var1  var2  var3
0     5     9     0
1     8     3     4
2     4     6     1
3     7     2     1
4     9     1     8

In [68]:
df.drop(1, axis = 0)

   var1  var2  var3
0     5     9     0
2     4     6     1
3     7     2     1
4     9     1     8

In [69]:
df.drop(1, axis = 0, inplace = True)

In [70]:
df

   var1  var2  var3
0     5     9     0
2     4     6     1
3     7     2     1
4     9     1     8

#### Fancy Index

In [71]:
l = [0, 2]
df.drop(l, axis = 0)

   var1  var2  var3
3     7     2     1
4     9     1     8

In [72]:
2 in df

False

In [73]:
df

   var1  var2  var3
0     5     9     0
2     4     6     1
3     7     2     1
4     9     1     8

#### Variables

In [74]:
"var1" in df

True

In [75]:
l = ["var1", "var4", "var2"]
for i in l:
    print(i in df)

True
False
True

In [76]:
df["var4"] = df["var1"] * df["var2"]

In [77]:
df

   var1  var2  var3  var4
0     5     9     0    45
2     4     6     1    24
3     7     2     1    14
4     9     1     8     9

#### Deleting Variables

In [78]:
df.drop("var4", axis = 1, inplace = True)

In [79]:
df

   var1  var2  var3
0     5     9     0
2     4     6     1
3     7     2     1
4     9     1     8

In [80]:
l = ["var1", "var2"]

In [81]:
df.drop(l, axis = 1)

   var3
0     0
2     1
3     1
4     8